MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MKV10Z128VLF7/mcu.h
/*! @name SOPT9 - System Options Register 9 */
/*! @{ */
#define SIM_SOPT9_CARRIER_SELECT1_MASK           (0x300U)
#define SIM_SOPT9_CARRIER_SELECT1_SHIFT          (8U)
/*! CARRIER_SELECT1 - Carrier frequency selection for FTM3/4 output channel
 *  0b00..FTM1_CH1 output provides the carrier signal for Timer Modulation mode
 *  0b01..LPTMR0 prescaler output provides the carrier signal for Timer Modulation mode
 *  0b10..FTM5_CH1 output provides the carrier signal for Timer Modulation mode
 *  0b11..Reserved
 */
#define SIM_SOPT9_CARRIER_SELECT1(x)             (((uint32_t)(((uint32_t)(x)) << SIM_SOPT9_CARRIER_SELECT1_SHIFT)) & SIM_SOPT9_CARRIER_SELECT1_MASK)
#define SIM_SOPT9_FTM3OCH0SRC_MASK               (0x10000U)
#define SIM_SOPT9_FTM3OCH0SRC_SHIFT              (16U)
/*! FTM3OCH0SRC - FTM3 channel 0 output PWM/OCMP mode source select
 *  0b0..FTM3CH0 pin is the output of FTM3 channel 0 PWM/OCMP
 *  0b1..FTM3CH0 pin is the output of FTM3 channel 0 PWM/OCMP modulating the carrier frequency, as per CARRIER_SELECT1
 */
#define SIM_SOPT9_FTM3OCH0SRC(x)                 (((uint32_t)(((uint32_t)(x)) << SIM_SOPT9_FTM3OCH0SRC_SHIFT)) & SIM_SOPT9_FTM3OCH0SRC_MASK)
#define SIM_SOPT9_FTM3OCH1SRC_MASK               (0x20000U)
#define SIM_SOPT9_FTM3OCH1SRC_SHIFT              (17U)
/*! FTM3OCH1SRC - FTM3 channel 1 output PWM/OCMP mode source select
 *  0b0..FTM3CH1 pin is the output of FTM3 channel 1 PWM/OCMP
 *  0b1..FTM3CH1 pin is the output of FTM3 channel 1 PWM/OCMP modulating the carrier frequency, as per CARRIER_SELECT1
 */
#define SIM_SOPT9_FTM3OCH1SRC(x)                 (((uint32_t)(((uint32_t)(x)) << SIM_SOPT9_FTM3OCH1SRC_SHIFT)) & SIM_SOPT9_FTM3OCH1SRC_MASK)
#define SIM_SOPT9_FTM3OCH2SRC_MASK               (0x40000U)
#define SIM_SOPT9_FTM3OCH2SRC_SHIFT              (18U)
/*! FTM3OCH2SRC - FTM3 channel 2 output PWM/OCMP mode source select
 *  0b0..FTM3CH2 pin is the output of FTM3 channel 2 PWM/OCMP
 *  0b1..FTM3CH2 pin is the output of FTM3 channel 2 PWM/OCMP modulating the carrier frequency, as per CARRIER_SELECT1
 */
#define SIM_SOPT9_FTM3OCH2SRC(x)                 (((uint32_t)(((uint32_t)(x)) << SIM_SOPT9_FTM3OCH2SRC_SHIFT)) & SIM_SOPT9_FTM3OCH2SRC_MASK)
#define SIM_SOPT9_FTM3OCH3SRC_MASK               (0x80000U)
#define SIM_SOPT9_FTM3OCH3SRC_SHIFT              (19U)
/*! FTM3OCH3SRC - FTM3 channel 3 output PWM/OCMP mode source select
 *  0b0..FTM3CH3 pin is the output of FTM3 channel 3 PWM/OCMP
 *  0b1..FTM3CH3 pin is the output of FTM3 channel 3 PWM/OCMP modulating the carrier frequency, as per CARRIER_SELECT1
 */
#define SIM_SOPT9_FTM3OCH3SRC(x)                 (((uint32_t)(((uint32_t)(x)) << SIM_SOPT9_FTM3OCH3SRC_SHIFT)) & SIM_SOPT9_FTM3OCH3SRC_MASK)
#define SIM_SOPT9_FTM3OCH4SRC_MASK               (0x100000U)
#define SIM_SOPT9_FTM3OCH4SRC_SHIFT              (20U)
/*! FTM3OCH4SRC - FTM3 channel 4 output PWM/OCMP mode source select
 *  0b0..FTM3CH4 pin is the output of FTM3 channel 4 PWM/OCMP
 *  0b1..FTM3CH4 pin is the output of FTM3 channel 4 PWM/OCMP modulating the carrier frequency, as per CARRIER_SELECT1
 */
#define SIM_SOPT9_FTM3OCH4SRC(x)                 (((uint32_t)(((uint32_t)(x)) << SIM_SOPT9_FTM3OCH4SRC_SHIFT)) & SIM_SOPT9_FTM3OCH4SRC_MASK)
#define SIM_SOPT9_FTM3OCH5SRC_MASK               (0x200000U)
#define SIM_SOPT9_FTM3OCH5SRC_SHIFT              (21U)
/*! FTM3OCH5SRC - FTM3 channel 5 output PWM/OCMP mode source select
 *  0b0..FTM3CH5 pin is the output of FTM3 channel 5 PWM/OCMP
 *  0b1..FTM3CH5 pin is the output of FTM3 channel 5 PWM/OCMP modulating the carrier frequency, as per CARRIER_SELECT1
 */
#define SIM_SOPT9_FTM3OCH5SRC(x)                 (((uint32_t)(((uint32_t)(x)) << SIM_SOPT9_FTM3OCH5SRC_SHIFT)) & SIM_SOPT9_FTM3OCH5SRC_MASK)
#define SIM_SOPT9_FTM4OCH0SRC_MASK               (0x400000U)
#define SIM_SOPT9_FTM4OCH0SRC_SHIFT              (22U)
/*! FTM4OCH0SRC - FTM4 channel 0 output PWM/OCMP mode source select
 *  0b0..FTM4CH0 pin is the output of FTM4 channel 0 PWM/OCMP
 *  0b1..FTM4CH0 pin is the output of FTM4 channel 0 PWM/OCMP modulating the carrier frequency, as per CARRIER_SELECT1
 */
#define SIM_SOPT9_FTM4OCH0SRC(x)                 (((uint32_t)(((uint32_t)(x)) << SIM_SOPT9_FTM4OCH0SRC_SHIFT)) & SIM_SOPT9_FTM4OCH0SRC_MASK)
#define SIM_SOPT9_FTM4OCH1SRC_MASK               (0x800000U)
#define SIM_SOPT9_FTM4OCH1SRC_SHIFT              (23U)
/*! FTM4OCH1SRC - FTM4 channel 1 output PWM/OCMP mode source select
 *  0b0..FTM4CH1 pin is the output of FTM4 channel 1 PWM/OCMP
 *  0b1..FTM4CH1 pin is the output of FTM4 channel 1 PWM/OCMP modulating the carrier frequency, as per CARRIER_SELECT1
 */
#define SIM_SOPT9_FTM4OCH1SRC(x)                 (((uint32_t)(((uint32_t)(x)) << SIM_SOPT9_FTM4OCH1SRC_SHIFT)) & SIM_SOPT9_FTM4OCH1SRC_MASK)
/*! @} */

/*! @name SDID - System Device Identification Register */
/*! @{ */
#define SIM_SDID_PINID_MASK                      (0xFU)
#define SIM_SDID_PINID_SHIFT                     (0U)
/*! PINID - Pincount identification
 *  0b0000..Reserved
 *  0b0001..Reserved
 *  0b0010..32-pin
 *  0b0011..Reserved
 *  0b0100..48-pin
 *  0b0101..64-pin
 *  0b0110..Reserved
 *  0b0111..Reserved
 *  0b1000..Reserved
 *  0b1001..Reserved
 *  0b1010..Reserved
 *  0b1011..Reserved
 *  0b1100..Reserved
 *  0b1101..Reserved
 *  0b1110..Reserved
 *  0b1111..Reserved
 */
#define SIM_SDID_PINID(x)                        (((uint32_t)(((uint32_t)(x)) << SIM_SDID_PINID_SHIFT)) & SIM_SDID_PINID_MASK)
#define SIM_SDID_DIEID_MASK                      (0xF80U)
#define SIM_SDID_DIEID_SHIFT                     (7U)
#define SIM_SDID_DIEID(x)                        (((uint32_t)(((uint32_t)(x)) << SIM_SDID_DIEID_SHIFT)) & SIM_SDID_DIEID_MASK)
#define SIM_SDID_REVID_MASK                      (0xF000U)
#define SIM_SDID_REVID_SHIFT                     (12U)
#define SIM_SDID_REVID(x)                        (((uint32_t)(((uint32_t)(x)) << SIM_SDID_REVID_SHIFT)) & SIM_SDID_REVID_MASK)
#define SIM_SDID_SRAMSIZE_MASK                   (0xF0000U)
#define SIM_SDID_SRAMSIZE_SHIFT                  (16U)
/*! SRAMSIZE
 *  0b0000..Reserved
 *  0b0001..Reserved
 *  0b0010..Reserved
 *  0b0011..Reserved
 *  0b0100..Reserved
 *  0b0101..16 KB
 *  0b0110..Reserved
 *  0b0111..Reserved
 */
#define SIM_SDID_SRAMSIZE(x)                     (((uint32_t)(((uint32_t)(x)) << SIM_SDID_SRAMSIZE_SHIFT)) & SIM_SDID_SRAMSIZE_MASK)
#define SIM_SDID_SERIERID_MASK                   (0xF00000U)
#define SIM_SDID_SERIERID_SHIFT                  (20U)
/*! SERIERID - Series ID
 *  0b0110..V-family - Motor control
 */
#define SIM_SDID_SERIERID(x)                     (((uint32_t)(((uint32_t)(x)) << SIM_SDID_SERIERID_SHIFT)) & SIM_SDID_SERIERID_MASK)
#define SIM_SDID_SUBFAMID_MASK                   (0xF000000U)
#define SIM_SDID_SUBFAMID_SHIFT                  (24U)
/*! SUBFAMID - V Sub-family ID
 *  0b0000..MKV10xxxx
 *  0b0001..MKV11xxxx
 */
#define SIM_SDID_SUBFAMID(x)                     (((uint32_t)(((uint32_t)(x)) << SIM_SDID_SUBFAMID_SHIFT)) & SIM_SDID_SUBFAMID_MASK)
#define SIM_SDID_FAMID_MASK                      (0xF0000000U)
#define SIM_SDID_FAMID_SHIFT                     (28U)
/*! FAMID - V-Family ID
 *  0b0001..MKV1xZx
 */
#define SIM_SDID_FAMID(x)                        (((uint32_t)(((uint32_t)(x)) << SIM_SDID_FAMID_SHIFT)) & SIM_SDID_FAMID_MASK)
/*! @} */

/*! @name SCGC4 - System Clock Gating Control Register 4 */
/*! @{ */
#define SIM_SCGC4_EWM_MASK                       (0x2U)
#define SIM_SCGC4_EWM_SHIFT                      (1U)
/*! EWM - EWM Clock Gate Control
 *  0b0..Clock disabled
 *  0b1..Clock enabled
 */
#define SIM_SCGC4_EWM(x)                         (((uint32_t)(((uint32_t)(x)) << SIM_SCGC4_EWM_SHIFT)) & SIM_SCGC4_EWM_MASK)
#define SIM_SCGC4_I2C0_MASK                      (0x40U)
#define SIM_SCGC4_I2C0_SHIFT                     (6U)
/*! I2C0 - I2C0 Clock Gate Control
 *  0b0..Clock disabled
 *  0b1..Clock enabled
 */
#define SIM_SCGC4_I2C0(x)                        (((uint32_t)(((uint32_t)(x)) << SIM_SCGC4_I2C0_SHIFT)) & SIM_SCGC4_I2C0_MASK)
#define SIM_SCGC4_UART0_MASK                     (0x400U)
#define SIM_SCGC4_UART0_SHIFT                    (10U)
/*! UART0 - UART0 Clock Gate Control
 *  0b0..Clock disabled
 *  0b1..Clock enabled
 */
#define SIM_SCGC4_UART0(x)                       (((uint32_t)(((uint32_t)(x)) << SIM_SCGC4_UART0_SHIFT)) & SIM_SCGC4_UART0_MASK)
#define SIM_SCGC4_UART1_MASK                     (0x800U)
#define SIM_SCGC4_UART1_SHIFT                    (11U)
/*! UART1 - UART1 Clock Gate Control
 *  0b0..Clock disabled
 *  0b1..Clock enabled
 */
#define SIM_SCGC4_UART1(x)                       (((uint32_t)(((uint32_t)(x)) << SIM_SCGC4_UART1_SHIFT)) & SIM_SCGC4_UART1_MASK)
#define SIM_SCGC4_CMP_MASK                       (0x80000U)
#define SIM_SCGC4_CMP_SHIFT                      (19U)
/*! CMP - Comparator Clock Gate Control
 *  0b0..Clock disabled
 *  0b1..Clock enabled
 */
#define SIM_SCGC4_CMP(x)                         (((uint32_t)(((uint32_t)(x)) << SIM_SCGC4_CMP_SHIFT)) & SIM_SCGC4_CMP_MASK)
/*! @} */

